chore: mermaidify
